In [1]:
from sqlalchemy import create_engine
engine = create_engine('sqlite://', echo=False)
import pandas as pd

/home/chowder/anaconda3/lib/python3.8/site-packages/pandas/core/computation/expressions.py:20: UserWarning: Pandas requires version '2.7.3' or newer of 'numexpr' (version '2.7.1' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED

In [5]:
sl = [[1,"Julia",88],
      [2,"Samantha",68],
      [3,"Maria",99],
      [4,"Scarlet",78],
      [5,"Ashley",63],
      [6,"Jane",81]]

sc = ["ID", "Name", "Marks"]
studentsDF = pd.DataFrame(data=sl, columns=sc)
studentsDF

   ID      Name  Marks
0   1     Julia     88
1   2  Samantha     68
2   3     Maria     99
3   4   Scarlet     78
4   5    Ashley     63
5   6      Jane     81

In [42]:
gl = [[1,0,9],
      [2,10,19],
      [3,20,29],
      [4,30,39],
      [5,40,49],
      [6,50,59],
      [7,60,69],
      [8,70,79],
      [9,80,89],
      [10,90,100]]
gc = ["Grade", "Min_Mark", "Max_Mark"]
gradesDF = pd.DataFrame(data=gl, columns=gc)
gradesDF

   Grade  Min_Mark  Max_Mark
0      1         0         9
1      2        10        19
2      3        20        29
3      4        30        39
4      5        40        49
5      6        50        59
6      7        60        69
7      8        70        79
8      9        80        89
9     10        90       100

In [43]:
studentsDF.to_sql(name='Students', con=engine, if_exists="replace")
gradesDF.to_sql(name='Grades', con=engine, if_exists="replace")

10

In [46]:
q = """
SELECT iif(g.Grade > 7, s.Name, "NULL"), g.Grade, s.Marks
FROM Students as s join Grades as g 
on s.Marks Between  g.Min_Mark and g.Max_Mark

ORDER BY g.Grade desc, s.Name
"""
q

'\nSELECT iif(g.Grade > 7, s.Name, "NULL"), g.Grade, s.Marks\nFROM Students as s join Grades as g \non s.Marks Between  g.Min_Mark and g.Max_Mark\n\nORDER BY g.Grade desc, s.Name\n'

In [47]:
from sqlalchemy import text
with engine.connect() as conn:
   resp = conn.execute(text(q)).fetchall()
resp

[('Maria', 10, 99),
 ('Jane', 9, 81),
 ('Julia', 9, 88),
 ('Scarlet', 8, 78),
 ('NULL', 7, 63),
 ('NULL', 7, 68)]